panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_capsense.h
                <Property id="ROTATE_DISTANCE_MIN" value="50"/>
                <Property id="ZOOM_DEBOUNCE" value="3"/>
                <Property id="ZOOM_DISTANCE_MIN" value="50"/>
                <Property id="FLICK_TIMEOUT_MAX" value="300"/>
                <Property id="FLICK_DISTANCE_MIN" value="100"/>
                <Property id="EDGE_EDGE_SIZE" value="200"/>
                <Property id="EDGE_DISTANCE_MIN" value="200"/>
                <Property id="EDGE_TIMEOUT_MAX" value="2000"/>
                <Property id="EDGE_ANGLE_MAX" value="45"/>
            </WidgetProperties>
            <Electrodes>
                <Electrode id="Sns0" kind="Sensor">
                    <ElectrodeProperties>
                        <Property id="IDAC0" value="32"/>
                        <Property id="IDAC1" value="32"/>
                        <Property id="IDAC2" value="32"/>
                        <Property id="PINS" value="Dedicated pin"/>
                    </ElectrodeProperties>
                </Electrode>
                <Electrode id="Sns1" kind="Sensor">
                    <ElectrodeProperties>
                        <Property id="IDAC0" value="32"/>
                        <Property id="IDAC1" value="32"/>
                        <Property id="IDAC2" value="32"/>
                        <Property id="PINS" value="Dedicated pin"/>
                    </ElectrodeProperties>
                </Electrode>
                <Electrode id="Sns2" kind="Sensor">
                    <ElectrodeProperties>
                        <Property id="IDAC0" value="32"/>
                        <Property id="IDAC1" value="32"/>
                        <Property id="IDAC2" value="32"/>
                        <Property id="PINS" value="Dedicated pin"/>
                    </ElectrodeProperties>
                </Electrode>
                <Electrode id="Sns3" kind="Sensor">
                    <ElectrodeProperties>
                        <Property id="IDAC0" value="32"/>
                        <Property id="IDAC1" value="32"/>
                        <Property id="IDAC2" value="32"/>
                        <Property id="PINS" value="Dedicated pin"/>
                    </ElectrodeProperties>
                </Electrode>
                <Electrode id="Sns4" kind="Sensor">
                    <ElectrodeProperties>
                        <Property id="IDAC0" value="32"/>
                        <Property id="IDAC1" value="32"/>
                        <Property id="IDAC2" value="32"/>
                        <Property id="PINS" value="Dedicated pin"/>
                    </ElectrodeProperties>
                </Electrode>
            </Electrodes>
        </Widget>
    </Widgets>
</Configuration>
CAPSENSE_CONFIG_END
*/

#if defined(__cplusplus)
}
#endif

#endif /* CY_CAPSENSE_CORE == __CORTEX_M */

#endif /* CYCFG_CAPSENSE_H */

/* [] END OF FILE */

